In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
ed=pd.read_csv("C:\DSBDA\employee_data.csv")
ed

   Employee_ID First_Name Last_Name   Department  Salary   Join_Date
0          101       John       Doe           HR   55000  2020-01-15
1          102       Jane     Smith  Engineering   65000  2019-05-20
2          103        Bob   Johnson      Finance   60000  2021-02-10
3          104      Alice  Williams    Marketing   58000  2020-11-30
4          105      David     Brown  Engineering   70000  2019-08-15
5          106      Sarah  Anderson      Finance   62000  2021-04-25
6          107    Michael     Clark           HR   52000  2020-03-05
7          108      Emily    Thomas    Marketing   59000  2020-09-12
8          109      James    Miller  Engineering   72000  2019-12-18
9          110       Lisa    Martin           HR   53000  2020-06-28

In [4]:
ed.loc[:,'Salary'].mean()

60600.0

In [5]:
ed.loc[:,'Salary'].median()

59500.0

In [6]:
ed.loc[:,'Salary'].mode()

0    52000
1    53000
2    55000
3    58000
4    59000
5    60000
6    62000
7    65000
8    70000
9    72000
Name: Salary, dtype: int64

In [7]:
ed.min()

Employee_ID            101
First_Name           Alice
Last_Name         Anderson
Department     Engineering
Salary               52000
Join_Date       2019-05-20
dtype: object

In [8]:
ed.loc[:,'Salary'].min(skipna = False)

52000

In [9]:
ed.loc[:,'Salary'].min(skipna = True)

52000

In [10]:
ed.max()

Employee_ID           110
First_Name          Sarah
Last_Name        Williams
Department      Marketing
Salary              72000
Join_Date      2021-04-25
dtype: object

In [11]:
ed.loc[:,'Salary'].max(skipna = False)

72000

In [12]:
ed.loc[:,'Salary'].max(skipna = True)

72000

In [13]:
ed.loc[:,'Salary'].std()

6769.211344183474

In [14]:
ed.groupby(['Department'])['Salary'].mean()

Department
Engineering    69000.000000
Finance        61000.000000
HR             53333.333333
Marketing      58500.000000
Name: Salary, dtype: float64

In [15]:
ed_u=ed.rename(columns= {'Salary':'Income'},inplace=False)
(ed_u.groupby(['Department']).Income.mean())

Department
Engineering    69000.000000
Finance        61000.000000
HR             53333.333333
Marketing      58500.000000
Name: Income, dtype: float64

In [16]:
from sklearn import preprocessing
enc = preprocessing.OneHotEncoder()
enc_ed = pd.DataFrame(enc.fit_transform(ed[['Department']]).toarray())

In [17]:
enc_ed

     0    1    2    3
0  0.0  0.0  1.0  0.0
1  1.0  0.0  0.0  0.0
2  0.0  1.0  0.0  0.0
3  0.0  0.0  0.0  1.0
4  1.0  0.0  0.0  0.0
5  0.0  1.0  0.0  0.0
6  0.0  0.0  1.0  0.0
7  0.0  0.0  0.0  1.0
8  1.0  0.0  0.0  0.0
9  0.0  0.0  1.0  0.0

In [18]:
ed_encode=ed_u.join(enc_ed)
ed_encode

,Employee_ID,First_Name,Last_Name,Department,Income,Join_Date,0,1,2,3
0,101,John,Doe,HR,55000,2020-01-15,0.0,0.0,1.0,0.0
1,102,Jane,Smith,Engineering,65000,2019-05-20,1.0,0.0,0.0,0.0
2,103,Bob,Johnson,Finance,60000,2021-02-10,0.0,1.0,0.0,0.0
3,104,Alice,Williams,Marketing,58000,2020-11-30,0.0,0.0,0.0,1.0
4,105,David,Brown,Engineering,70000,2019-08-15,1.0,0.0,0.0,0.0
5,106,Sarah,Anderson,Finance,62000,2021-04-25,0.0,1.0,0.0,0.0
6,107,Michael,Clark,HR,52000,2020-03-05,0.0,0.0,1.0,0.0
7,108,Emily,Thomas,Marketing,59000,2020-09-12,0.0,0.0,0.0,1.0
8,109,James,Miller,Engineering,72000,2019-12-18,1.0,0.0,0.0,0.0
9,110,Lisa,Martin,HR,53000,2020-06-28,0.0,0.0,1.0,0.0

In [19]:
import pandas as pd

In [20]:
csv_url = "C:\DSBDA\iris (2).csv"

In [21]:
col_names =['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width','Species']

In [22]:
iris = pd.read_csv(csv_url, names = col_names)
iris

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0    sepal_length  sepal_width  petal_length  petal_width    species
1             5.1          3.5           1.4          0.2     setosa
2             4.9          3.0           1.4          0.2     setosa
3             4.7          3.2           1.3          0.2     setosa
4             4.6          3.1           1.5          0.2     setosa
..            ...          ...           ...          ...        ...
146           6.7          3.0           5.2          2.3  virginica
147           6.3          2.5           5.0          1.9  virginica
148           6.5          3.0           5.2          2.0  virginica
149           6.2          3.4           5.4          2.3  virginica
150           5.9          3.0           5.1          1.8  virginica

[151 rows x 5 columns]

In [23]:
irisSet = (iris['Species']== 'Iris-setosa')

In [24]:
print('Iris-setosa')
print(iris[irisSet].describe())

Iris-setosa
       Sepal_Length Sepal_Width Petal_Length Petal_Width Species
count             0           0            0           0       0
unique            0           0            0           0       0
top             NaN         NaN          NaN         NaN     NaN
freq            NaN         NaN          NaN         NaN     NaN

In [25]:
irisVer = (iris['Species']== 'Iris-versicolor')

In [26]:
print('Iris-versicolor')
print(iris[irisVer].describe())

Iris-versicolor
       Sepal_Length Sepal_Width Petal_Length Petal_Width Species
count             0           0            0           0       0
unique            0           0            0           0       0
top             NaN         NaN          NaN         NaN     NaN
freq            NaN         NaN          NaN         NaN     NaN

In [27]:
irisVir = (iris['Species']== 'Iris-virginica')

In [28]:
print('Iris-virginica')
print(iris[irisVir].describe())

Iris-virginica
       Sepal_Length Sepal_Width Petal_Length Petal_Width Species
count             0           0            0           0       0
unique            0           0            0           0       0
top             NaN         NaN          NaN         NaN     NaN
freq            NaN         NaN          NaN         NaN     NaN